In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [15]:
df = pd.read_csv('Social_Network_Ads.csv')
df.head(2)

    User ID Gender  Age  EstimatedSalary  Purchased
0  15624510   Male   19            19000          0
1  15810944   Male   35            20000          0

In [16]:
# We can grab the oclumn names with .columns
df.columns

Index(['User ID', 'Gender', 'Age', 'EstimatedSalary', 'Purchased'], dtype='object')

In [17]:
#We can retrieve rows through indexing
df.index[2]

2

In [21]:
#We can also assign values to entire columns
df['New_column']="New Value"

In [22]:
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased New_column
0  15624510    Male   19            19000          0  New Value
1  15810944    Male   35            20000          0  New Value
2  15668575  Female   26            43000          0  New Value
3  15603246  Female   27            57000          0  New Value
4  15804002    Male   19            76000          0  New Value

In [23]:
#We can also delete columns
del df['New_column']

df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [24]:
#DataFrames can be constructed from a dictionary of equal length lists
data = {'City':['SF','LA','NYC'],
        'Population':[837000,3880000,8400000]}

city_frame = DataFrame(data)
city_frame

  City  Population
0   SF      837000
1   LA     3880000
2  NYC     8400000

In [25]:
data_dict = city_frame.to_dict()

In [27]:
new_cf = DataFrame(data_dict)

In [28]:
new_cf

  City  Population
0   SF      837000
1   LA     3880000
2  NYC     8400000

In [29]:
data_dict

{'City': {0: 'SF', 1: 'LA', 2: 'NYC'},
 'Population': {0: 837000, 1: 3880000, 2: 8400000}}

In [31]:
city_frame.to_csv('sample.csv', index=False)